# RebarSystemCoverSide Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemCoverSide Property
ParameterTypeId Class See Also
---
"Rebar Cover Side/Edge"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemCoverSide { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemCoverSide As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemCoverSide {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace